adsl91522/STM32-Library/lib/w25qxx/w25qxx.c
#include "stm32f0xx_hal.h"
#include "w25qxx.h"


#define W25QXX_DEBUG				0

#if (W25QXX_DEBUG == 1)
#include <stdio.h>
#endif

#define W25QXX_DUMMY_BYTE         	0x00

w25qxx_t	w25qxx;

#if (_W25QXX_USE_FREERTOS==1)
#define	W25qxx_Delay(delay)		osDelay(delay)
#include "cmsis_os.h"
#else
#define	W25qxx_Delay(delay)		HAL_Delay(delay)
#endif
//###################################################################################################################
uint8_t	W25qxx_Spi(uint8_t Data)
{
	uint8_t	ret;
	HAL_SPI_TransmitReceive(&W25QXX_SPI, &Data, &ret, 1, W25QXX_TIMEOUT_VALUE);
	return ret;	
}
//###################################################################################################################
uint32_t W25qxx_ReadID(void)
{
	uint32_t Temp = 0, Temp0 = 0, Temp1 = 0, Temp2 = 0;
	W25QXX_CS(0);
	W25qxx_Spi(0x9F);
	Temp0 = W25qxx_Spi(0x00);					//MSB
	Temp1 = W25qxx_Spi(0x00);
	Temp2 = W25qxx_Spi(0x00);
	W25QXX_CS(1);
  	Temp = (Temp0 << 16) | (Temp1 << 8) | Temp2;
  	return Temp;
}
//###################################################################################################################
void W25qxx_ReadUniqID(void)
{
	W25QXX_CS(0);
	W25qxx_Spi(0x4B);
	for(uint8_t	i=0;i<4;i++){
		W25qxx_Spi(W25QXX_DUMMY_BYTE);
	}
	for(uint8_t	i=0;i<8;i++){
		w25qxx.UniqID[i] = W25qxx_Spi(W25QXX_DUMMY_BYTE);
	}
	W25QXX_CS(1);
}
//###################################################################################################################
void W25qxx_WriteEnable(void)
{
	W25QXX_CS(0);
	W25qxx_Spi(0x06);
	W25QXX_CS(1);
	W25qxx_Delay(1);
}
//###################################################################################################################
void W25qxx_WriteDisable(void)
{
	W25QXX_CS(0);
	W25qxx_Spi(0x04);
  	W25QXX_CS(1);
	W25qxx_Delay(1);
}
//###################################################################################################################
uint8_t W25qxx_ReadStatusRegister(uint8_t SelectStatusRegister_1_2_3)
{
	uint8_t	status=0;
	W25QXX_CS(0);
	if(SelectStatusRegister_1_2_3==1)
	{
		W25qxx_Spi(0x05);
		status=W25qxx_Spi(W25QXX_DUMMY_BYTE);	
		w25qxx.StatusRegister1 = status;
	}
	else if(SelectStatusRegister_1_2_3==2)
	{
		W25qxx_Spi(0x35);
		status=W25qxx_Spi(W25QXX_DUMMY_BYTE);	
		w25qxx.StatusRegister2 = status;
	}
	else
	{
		W25qxx_Spi(0x15);
		status=W25qxx_Spi(W25QXX_DUMMY_BYTE);	
		w25qxx.StatusRegister3 = status;
	}	
	W25QXX_CS(1);
	return status;
}
//###################################################################################################################
void W25qxx_WriteStatusRegister(uint8_t	SelectStatusRegister_1_2_3, uint8_t Data)
{
	W25QXX_CS(0);
	if(SelectStatusRegister_1_2_3==1)
	{
		W25qxx_Spi(0x01);
		w25qxx.StatusRegister1 = Data;
	}
	else if(SelectStatusRegister_1_2_3==2)
	{
		W25qxx_Spi(0x31);
		w25qxx.StatusRegister2 = Data;
	}
	else
	{
		W25qxx_Spi(0x11);
		w25qxx.StatusRegister3 = Data;
	}
	W25qxx_Spi(Data);
	W25QXX_CS(1);
}
//###################################################################################################################
void W25qxx_WaitForWriteEnd(void)
{
	W25qxx_Delay(1);
	W25QXX_CS(0);
	W25qxx_Spi(0x05);
  do
  {
    w25qxx.StatusRegister1 = W25qxx_Spi(W25QXX_DUMMY_BYTE);
		W25qxx_Delay(1);
  }
  while ((w25qxx.StatusRegister1 & 0x01) == 0x01);
  W25QXX_CS(1);
}
//###################################################################################################################
void W25qxx_Init(void)
{
	w25qxx.Lock=1;	
	while(HAL_GetTick()<100)
	W25qxx_Delay(1);
	W25QXX_CS(1);
	W25qxx_Delay(100);
	uint32_t id;
#if (W25QXX_DEBUG==1)
	printf("w25qxx Init Begin...\r\n");
#endif
	id=W25qxx_ReadID();
	
#if (W25QXX_DEBUG==1)
	printf("w25qxx ID:0x%X\r\n", id);
#endif
	switch(id&0x0000FFFF)
	{
		case 0x401A:	// 	w25q512
			w25qxx.ID=W25Q512;
			w25qxx.BlockCount=1024;
#if (W25QXX_DEBUG==1)
			printf("w25qxx Chip: w25q512\r\n");
#endif
		break;
		case 0x4019:	// 	w25q256
			w25qxx.ID=W25Q256;
			w25qxx.BlockCount=512;
#if (W25QXX_DEBUG==1)
			printf("w25qxx Chip: w25q256\r\n");
#endif
		break;
		case 0x4018:	// 	w25q128
			w25qxx.ID=W25Q128;
			w25qxx.BlockCount=256;
#if (W25QXX_DEBUG==1)
			printf("w25qxx Chip: w25q128\r\n");
#endif
		break;
		case 0x4017:	//	w25q64
			w25qxx.ID=W25Q64;
			w25qxx.BlockCount=128;
#if (W25QXX_DEBUG==1)
			printf("w25qxx Chip: w25q64\r\n");
#endif
		break;
		case 0x4016:	//	w25q32
			w25qxx.ID=W25Q32;
			w25qxx.BlockCount=64;
#if (W25QXX_DEBUG==1)
			printf("w25qxx Chip: w25q32\r\n");
#endif
		break;
		case 0x4015:	//	w25q16
			w25qxx.ID=W25Q16;
			w25qxx.BlockCount=32;
#if (W25QXX_DEBUG==1)
			printf("w25qxx Chip: w25q16\r\n");
#endif
		break;
		case 0x4014:	//	w25q80
			w25qxx.ID=W25Q80;
			w25qxx.BlockCount=16;
#if (W25QXX_DEBUG==1)
			printf("w25qxx Chip: w25q80\r\n");
#endif
		break;
		case 0x4013:	//	w25q40
			w25qxx.ID=W25Q40;
			w25qxx.BlockCount=8;
#if (W25QXX_DEBUG==1)
			printf("w25qxx Chip: w25q40\r\n");
#endif
		break;
		case 0x4012:	//	w25q20
			w25qxx.ID=W25Q20;
			w25qxx.BlockCount=4;
#if (W25QXX_DEBUG==1)
			printf("w25qxx Chip: w25q20\r\n");
#endif
		break;
		case 0x4011:	//	w25q10
			w25qxx.ID=W25Q10;
			w25qxx.BlockCount=2;
#if (W25QXX_DEBUG==1)
			printf("w25qxx Chip: w25q10\r\n");
#endif
		break;
		default:
			return;
#if (W25QXX_DEBUG==1)
			printf("w25qxx Unknown ID\r\n");
			w25qxx.Lock=0;

#endif
	}		
	w25qxx.PageSize=256;
	w25qxx.SectorSize=0x1000;
	w25qxx.SectorCount=w25qxx.BlockCount*16;
	w25qxx.PageCount=(w25qxx.SectorCount*w25qxx.SectorSize)/w25qxx.PageSize;
	w25qxx.BlockSize=w25qxx.SectorSize*16;
	w25qxx.CapacityInKiloByte=(w25qxx.SectorCount*w25qxx.SectorSize)/1024;
	W25qxx_ReadUniqID();
	W25qxx_ReadStatusRegister(1);
	W25qxx_ReadStatusRegister(2);
	W25qxx_ReadStatusRegister(3);
#if (W25QXX_DEBUG==1)
	printf("w25qxx Page Size: %d Bytes\r\n", w25qxx.PageSize);
	printf("w25qxx Page Count: %ld\r\n", w25qxx.PageCount);
	printf("w25qxx Sector Size: %ld Bytes\r\n", w25qxx.SectorSize);
	printf("w25qxx Sector Count: %ld\r\n", w25qxx.SectorCount);
	printf("w25qxx Block Size: %ld Bytes\r\n", w25qxx.BlockSize);
	printf("w25qxx Block Count: %ld\r\n", w25qxx.BlockCount);
	printf("w25qxx Capacity: %ld KiloBytes\r\n", w25qxx.CapacityInKiloByte);
	printf("w25qxx Init Done\r\n");
#endif
	w25qxx.Lock=0;	

